export const km = {
  // Navbar
  projects: "គម្រោង",
  archive: "បណ្ណសារ",

  // Home Page
  name: "ស៊ា ហ៊ុយទី",

  aboutIntro:
    "សួស្តី! ខ្ញុំគឺជា ស៊ា ហ៊ុយទី អ្នកអភិវឌ្ឍន៍សូហ្វវែរ និងជានិស្សិតជំនាញវិទ្យាសាស្ត្រកុំព្យូទ័រ ឯកទេសផ្នែកវិស្វកម្មសូហ្វវែរ។",

  aboutPassion:
    "ខ្ញុំមានចំណង់ចំណូលចិត្តក្នុងការបង្កើតបច្ចេកវិទ្យាដែលអាចផ្តល់ផលប៉ះពាល់ល្អដល់សង្គម។ ខ្ញុំចូលចិត្តស្វែងយល់ផ្នែកបច្ចេកវិទ្យាផ្សេងៗ ចាប់ពី កម្មវិធីទូរស័ព្ទ និងគេហទំព័រ រហូតដល់ AI ទិន្នន័យវិទ្យា និង IoT។ បច្ចុប្បន្ន ខ្ញុំកំពុងសិក្សាផ្នែកវិទ្យាសាស្ត្រកុំព្យូទ័រ ព្រមទាំងចូលរួម កម្មវិធីបណ្តុះបណ្តាល Data Science ដើម្បីពង្រីកចំណេះដឹងផ្នែកទិន្នន័យ និងបញ្ញាសិប្បនិម្មិត។",

  aboutOutside:
    "ក្រៅពីការសរសេរកម្មវិធី ខ្ញុំចូលចិត្ត ធ្វើដំណើរ និងរក្សាសុខភាពឱ្យមានទម្រង់ល្អ។ ខ្ញុំចូលចិត្តសាកល្បងកីឡាផ្សេងៗ និងរក្សាភាពសកម្ម ជាមនុស្សចេះគ្រប់កីឡា ប៉ុន្តែមិនប៉ិនប្រសប់ណាមួយទេ។",

  aboutQuestionLead: "ខ្ញុំក៏ចាប់អារម្មណ៍នឹងសំណួរធំមួយផងដែរ៖",

  aboutQuote:
    "ចុះបើម៉ាស៊ីនអាចធ្វើការងារទាំងអស់ជំនួសមនុស្ស ហើយមនុស្សមានសេរីភាពគ្រាន់តែរស់នៅ រៀនសូត្រ ស្វែងយល់ និងបង្កើតថ្មី?",

  educationTitle: "ការអប់រំ",
  experienceTitle: "បទពិសោធន៍",

  selectedHonors: "កិត្តិយសដែលទទួលបាន",

  // Projects Page
  projectsTitle: "គម្រោង",

  projectsSubtitle:
    "សូមទស្សនាគម្រោងរបស់ខ្ញុំ ដើម្បីឃើញពីរបៀបដែលខ្ញុំដោះស្រាយបញ្ហាប្រឈមផ្សេងៗ និងប្រែក្លាយគំនិតឱ្យក្លាយជាការពិត។",

  exploreCategoryProjects: "ស្វែងយល់ពីគម្រោង{category}របស់ខ្ញុំ",

  project: "គម្រោង",
  projectsPlural: "គម្រោង",

  // Archive Page
  archivesTitle: "បណ្ណសារ",

  // Theme Toggle
  switchToDarkMode: "ប្តូរទៅផ្ទៃងងឹត",
  switchToLightMode: "ប្តូរទៅផ្ទៃភ្លឺ",

  // Language Toggle
  switchToKhmer: "ប្តូរទៅភាសាខ្មែរ",
  switchToEnglish: "Switch to English",
};
